{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day", "What's up?", "Howdy", "Hi"],
      "responses": ["Good to see you again!", "Hi there, how can I help?", "Hello! How may I assist you today?"],
      "context": [""]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting with you, bye", "Till next time", "Catch you later", "Talk to you soon"],
      "responses": ["See you!", "Have a nice day!", "Bye! Come back again soon.", "Goodbye, and take care!"],
      "context": [""]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me", "Much appreciated", "Thanks a lot"],
      "responses": ["My pleasure!", "You're welcome!", "Glad I could help.", "Anytime!"],
      "context": [""]
    },
    {
      "tag": "about_me",
      "patterns": ["Intro", "Explain about yourself", "Who are you?", "Tell me about yourself", "Introduce yourself"],
      "responses": [
        "My name is Huzaifa Aftab, and I am  currently in my 5th semester of Electrical Engineering at the National University of Sciences and Technology (NUST), Islamabad. I have a deep and growing interest in Artificial Intelligence, particularly in the areas of Machine Learning (ML) and Natural Language Processing (NLP). My passion lies in using technology to create solutions that solve real-world problems, especially in the fields of education, automation, and intelligent systems.\n\nOver time, I were  developed practical experience by working on AI-based projects, including a hand gesture recognition system using CNN, a garbage classification model, and a student assistant chatbot built with NLP techniques. I am  proficient in Python and C++, and I frequently use tools and libraries such as TensorFlow, scikit-learn, pandas, NumPy, and matplotlib. I enjoy building end-to-end systems—from data preprocessing to model deployment—and I constantly seek to learn new concepts and refine my technical skills.\n\nAs a person, I am curious, disciplined, and solution-focused. I believe in continuous learning, and I’m excited about the transformative potential of AI in reshaping how we live and interact with the world. Outside of academics, I pursue hobbies that strengthen both my body and mind, including playing chess, going to the gym, and watching movies—which often inspire new ideas and help me maintain a balanced lifestyle.\n\n"


      ],
      "context": [""]
    },
    {
      "tag": "why_hire",
      "patterns": ["Why should we hire you?", "Why are you the best for this role?", "Why someone will hire you?", "What makes you a good candidate?", "Why you?"],
      "responses": [
        "I am passionate about learning and implementing new ideas. I bring dedication, technical skills, and problem-solving abilities to the table. My growing experience with ML and data projects makes me a strong candidate.",
        "I have hands-on experience in Python, data science, and machine learning. I am a fast learner, collaborative, and driven to contribute effectively to any team or project.",
        "I am not just technically sound but also passionate about applying technology to real-world challenges. I take ownership of my work, learn quickly, and strive for excellence in every task."
      ],
      "context": [""]
    },
    {
      "tag": "gpa",
      "patterns": ["What is your GPA?", "Your CGPA?", "Tell me your grades", "What's your academic performance?", "Whats your GPA, CGPA"],
      "responses": [
        "My current CGPA is 3.03 out of 4.0.",
        "I have maintained a CGPA of 3.03 throughout my studies at NUST.",
        "Academically, I’ve been consistent with a CGPA of 3.03. I believe in balancing practical learning and theoretical knowledge."
      ],
      "context": [""]
    },
    {
      "tag": "projects",
      "patterns": ["Tell us about your projects", "What projects have you done?", "Your recent work?", "Any interesting projects?", "Project experience?", "Describe your projects"],
      "responses": [
        "I've completed several projects including:\n- A **CNN-based hand gesture recognition system** for Rock-Paper-Scissors using Python and OpenCV.\n- A **Garbage Classification Model** using deep learning to detect different types of waste like plastic and metal.\n- A **Chatbot for student assistance** using NLP techniques and TensorFlow.\n- A **Data analysis tool** using Pandas and Matplotlib to study trends in structured datasets.",
        "I’ve worked on AI-based projects such as:\n- Hand gesture recognition using CNN\n- Garbage image classifier\n- Student Q&A chatbot using NLTK and intents\nI also made small Python games and explored basic frontend tools.",
        "Some of my recent work includes combining ML and NLP in a vocabulary learning app, using techniques like Bag of Words, TF-IDF, and Word2Vec. I also created a CNN project for classifying metal and waste, and a machine-learning ensemble model comparison project."
      ],
      "context": [""]
    },
    {
      "tag": "skills",
      "patterns": ["What are your skills?", "Skills?", "Tell me your skills", "Technical skills?", "Programming languages you know?", "Which tools you use?"],
      "responses": [
        "Here are some of my key skills:\n- **Programming Languages**: Python, C++\n- **Machine Learning Libraries**: scikit-learn, TensorFlow, Keras\n- **Data Science Tools**: Pandas, NumPy, Matplotlib, Seaborn\n- **NLP**: Tokenization, TF-IDF, Bag of Words, Word2Vec, NLTK\n- **Basic Web Development**: HTML, CSS, Flask for ML model deployment\n- **Version Control**: Git, GitHub",
        "My skill set includes:\n- Proficient in Python and C++\n- Experienced with machine learning algorithms and frameworks (TensorFlow, scikit-learn)\n- Strong understanding of data preprocessing, feature engineering, and model evaluation\n- Natural Language Processing (TF-IDF, Word2Vec, BERT basics)",
        "I'm skilled in:\n- Python and C++ programming\n- Supervised ML algorithms (Regression, KNN, Decision Trees, Random Forests)\n- Deep learning (ANN , CNN,  RNN)\n- NLP \n- GUI development with Tkinter \n Simple 2D Game Development \n Arduino"
      ],
      "context": [""]
    },
    {
      "tag": "contact_info",
      "patterns": ["How can I contact you?", "What's your email?", "Can I get your LinkedIn?", "How to connect with you?", "Your contact info?", "How do I reach you?"],
      "responses": [
        "You can contact me via email at **huzaifa.aftab@example.com**.",
        "Feel free to connect with me on LinkedIn: **https://www.linkedin.com/in/huzaifaaftab**",
        "For any professional inquiries, you can reach me through email or my LinkedIn profile."
      ],
      "context": [""]
    },
    {
      "tag": "hobbies",
      "patterns": ["What are your hobbies?", "What do you do in your free time?", "Any hobbies?", "What are you passionate about besides studies?", "Tell me about your hobbies"],
      "responses": [
        "In my free time, I love playing **chess**, going to the **gym**, and watching **movies**. These hobbies help me relax, stay mentally and physically fit, and sometimes even inspire creative thinking for my projects.",
        "My hobbies include **playing strategic games like chess**, **working out at the gym**, and **watching movies**—especially sci-fi and inspirational genres.",
        "I enjoy staying active with the gym, sharpening my mind through chess, and winding down with a good movie. These activities help me maintain a balanced and energetic lifestyle."
      ],
      "context": [""]
    }
  ]
}
